<a href="https://colab.research.google.com/github/HYUNJAE-JEON/HYUNJAE-Python-Exercise/blob/master/2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 필요한 파일들을 먼저 다운로드 받습니다.
아래의 명령어들은 ubuntu(linux)에서 사용하는 명령어들입니다.

In [26]:
!wget --no-check-certificate 'https://docs.google.com/uc?export=download&id=1ynuYg99H5oQ8Thklsc9cKHnQq88HpAIS' -O '급여정보.csv'
!wget --no-check-certificate 'https://docs.google.com/uc?export=download&id=1LO6qkchgSuAA-ZBdpjfYvmKWSHb-XLS1' -O '급여정보.xlsx'
!wget --no-check-certificate 'https://docs.google.com/uc?export=download&id=16bWJxAuCAAvBGpg8NBIgA0pomK6n6o3y' -O '인적사항.csv'
!wget --no-check-certificate 'https://docs.google.com/uc?export=download&id=14vHF0Skpg4pnWT0VYm7RzhD3vMdw2jnn' -O '인적사항.xlsx'

--2020-11-17 05:41:08--  https://docs.google.com/uc?export=download&id=1ynuYg99H5oQ8Thklsc9cKHnQq88HpAIS
Resolving docs.google.com (docs.google.com)... 74.125.28.138, 74.125.28.101, 74.125.28.102, ...
Connecting to docs.google.com (docs.google.com)|74.125.28.138|:443... connected.
HTTP request sent, awaiting response... 302 Moved Temporarily
Location: https://doc-0k-5k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/78id9b7l4emfmf5pnlfqk4s3t8lkddks/1605591600000/00428902114429155006/*/1ynuYg99H5oQ8Thklsc9cKHnQq88HpAIS?e=download [following]
Warning: wildcards not supported in HTTP.
--2020-11-17 05:41:08--  https://doc-0k-5k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/78id9b7l4emfmf5pnlfqk4s3t8lkddks/1605591600000/00428902114429155006/*/1ynuYg99H5oQ8Thklsc9cKHnQq88HpAIS?e=download
Resolving doc-0k-5k-docs.googleusercontent.com (doc-0k-5k-docs.googleusercontent.com)... 74.125.142.132, 2607:f8b0:400e:c08::84
Connecting to doc-0k-5k-docs.googleusercontent.com (doc-0k-5k-docs.googleusercontent.com)|74.125.142.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 197 [text/csv]
Saving to: ‘급여정보.csv’

급여정보.csv        100%[===================>]     197  --.-KB/s    in 0s

2020-11-17 05:41:08 (6.31 MB/s) - ‘급여정보.csv’ saved [197/197]

--2020-11-17 05:41:08--  https://docs.google.com/uc?export=download&id=1LO6qkchgSuAA-ZBdpjfYvmKWSHb-XLS1
Resolving docs.google.com (docs.google.com)... 74.125.20.139, 74.125.20.113, 74.125.20.138, ...
Connecting to docs.google.com (docs.google.com)|74.125.20.139|:443... connected.
HTTP request sent, awaiting response... 302 Moved Temporarily
Location: https://doc-0k-5k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/n03vunp4t879ts6n4hv53qgnedbfrsjb/1605591600000/00428902114429155006/*/1LO6qkchgSuAA-ZBdpjfYvmKWSHb-XLS1?e=download [following]
Warning: wildcards not supported in HTTP.
--2020-11-17 05:41:09--  https://doc-0k-5k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/n03vunp4t879ts6n4hv53qgnedbfrsjb/1605591600000/00428902114429155006/*/1LO6qkchgSuAA-ZBdpjfYvmKWSHb-XLS1?e=download
Resolving doc-0k-5k-docs.googleusercontent.com (doc-0k-5k-docs.googleusercontent.com)... 74.125.142.132, 2607:f8b0:400e:c08::84
Connecting to doc-0k-5k-docs.googleusercontent.com (doc-0k-5k-docs.googleusercontent.com)|74.125.142.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 5673 (5.5K) [application/haansoftxlsx]
Saving to: ‘급여정보.xlsx’

급여정보.xlsx       100%[===================>]   5.54K  --.-KB/s    in 0s

2020-11-17 05:41:09 (49.3 MB/s) - ‘급여정보.xlsx’ saved [5673/5673]

--2020-11-17 05:41:09--  https://docs.google.com/uc?export=download&id=16bWJxAuCAAvBGpg8NBIgA0pomK6n6o3y
Resolving docs.google.com (docs.google.com)... 74.125.195.139, 74.125.195.138, 74.125.195.100, ...
Connecting to docs.google.com (docs.google.com)|74.125.195.139|:443... connected.
HTTP request sent, awaiting response... 302 Moved Temporarily
Location: https://doc-0o-5k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/fgnok61fj8md6vo1ec5ggf1ia3a0td1i/1605591600000/00428902114429155006/*/16bWJxAuCAAvBGpg8NBIgA0pomK6n6o3y?e=download [following]
Warning: wildcards not supported in HTTP.
--2020-11-17 05:41:09--  https://doc-0o-5k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/fgnok61fj8md6vo1ec5ggf1ia3a0td1i/1605591600000/00428902114429155006/*/16bWJxAuCAAvBGpg8NBIgA0pomK6n6o3y?e=download
Resolving doc-0o-5k-docs.googleusercontent.com (doc-0o-5k-docs.googleusercontent.com)... 74.125.142.132, 2607:f8b0:400e:c08::84
Connecting to doc-0o-5k-docs.googleusercontent.com (doc-0o-5k-docs.googleusercontent.com)|74.125.142.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 183 [text/csv]
Saving to: ‘인적사항.csv’

인적사항.csv        100%[===================>]     183  --.-KB/s    in 0s

2020-11-17 05:41:09 (6.14 MB/s) - ‘인적사항.csv’ saved [183/183]

--2020-11-17 05:41:09--  https://docs.google.com/uc?export=download&id=14vHF0Skpg4pnWT0VYm7RzhD3vMdw2jnn
Resolving docs.google.com (docs.google.com)... 74.125.20.113, 74.125.20.139, 74.125.20.101, ...
Connecting to docs.google.com (docs.google.com)|74.125.20.113|:443... connected.
HTTP request sent, awaiting response... 302 Moved Temporarily
Location: https://doc-08-5k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/67bhc9le5jqvqnp27qt0cbisl40nuk1u/1605591600000/00428902114429155006/*/14vHF0Skpg4pnWT0VYm7RzhD3vMdw2jnn?e=download [following]
Warning: wildcards not supported in HTTP.
--2020-11-17 05:41:10--  https://doc-08-5k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/67bhc9le5jqvqnp27qt0cbisl40nuk1u/1605591600000/00428902114429155006/*/14vHF0Skpg4pnWT0VYm7RzhD3vMdw2jnn?e=download
Resolving doc-08-5k-docs.googleusercontent.com (doc-08-5k-docs.googleusercontent.com)... 74.125.142.132, 2607:f8b0:400e:c08::84
Connecting to doc-08-5k-docs.googleusercontent.com (doc-08-5k-docs.googleusercontent.com)|74.125.142.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 5670 (5.5K) [application/haansoftxlsx]
Saving to: ‘인적사항.xlsx’

인적사항.xlsx       100%[===================>]   5.54K  --.-KB/s    in 0s

2020-11-17 05:41:10 (45.4 MB/s) - ‘인적사항.xlsx’ saved [5670/5670]

### 다운로드받은 파일들을 확인해보세요.

In [27]:
import pandas as pd
# pd.Series
# pd.DataFrame
import numpy as np
# pandas 내부에서 Series, DataFrame 두 클래스를 따로 불러온다.
from pandas import Series, DataFrame
# Series

## Series
- 1차원 데이터 구조
- numpy의 배열구조를 사용

In [28]:
# 시리즈 생성 후 출력
ser1 = Series([4,5,3,-6])
ser1

0    4
1    5
2    3
3   -6
dtype: int64

In [29]:
ser2 = Series([4,5,3,-6], index=['a','b','c','d'])
ser2

a    4
b    5
c    3
d   -6
dtype: int64

In [30]:
# 숫자인덱스 슬라이싱 - 마지막값 미포함
# 라벨 기반 슬라이싱 - 마지막값을 포함
ser2['b'], ser2['b':'d']
ser2[1:4]
ser2['b':'c']

b    5
c    3
dtype: int64

In [31]:
ser2>3

a     True
b     True
c    False
d    False
dtype: bool

In [32]:
# boolean indexing - 조건 인덱싱
ser2[ser2>3]

a    4
b    5
dtype: int64

In [33]:
ser3 = Series(np.random.randint(1,10,10))
ser3

0    5
1    7
2    5
3    6
4    3
5    4
6    3
7    7
8    2
9    2
dtype: int64

In [34]:
# 시리즈의 고유값들의 개수 count
ser3.value_counts()

7    2
5    2
3    2
2    2
6    1
4    1
dtype: int64

## DataFrame
- Pandas의 2차원 데이터 구조

### 생성법
1. 딕셔너리 형태의 데이터를 사용
2. 그냥 2차원 배열 형태의 데이터를 사용
3. 2차원 데이터 파일을 읽어옴

In [35]:
data = {
    'name':['홍길동','김철수','김영희'],
    'score':[90,70,80],
    'age':[25,30,32]
}
data['name']

['홍길동', '김철수', '김영희']

In [36]:
df = DataFrame(data)
df

  name  score  age
0  홍길동     90   25
1  김철수     70   30
2  김영희     80   32

In [37]:
df = DataFrame(data,
            columns=['name','age','score'], # 열 라벨
            index=['a','b','c']) # 행 라벨
df

  name  age  score
a  홍길동   25     90
b  김철수   30     70
c  김영희   32     80

In [38]:
df2 = DataFrame([[1,2,3],
                 [4,5,6]],
               columns=['one','two','three'],
               index=pd.date_range('20200721',periods=2)) 
               # 2020년7월21일부터 2일간 날짜목록
df2

            one  two  three
2020-07-21    1    2      3
2020-07-22    4    5      6

In [39]:
pd.date_range('20200721',periods=6, freq='3d')

DatetimeIndex(['2020-07-21', '2020-07-24', '2020-07-27', '2020-07-30',
               '2020-08-02', '2020-08-05'],
              dtype='datetime64[ns]', freq='3D')

## 파일 읽어오는 방법
- pd.read_확장자명(파일이름)
  - csv
  - excel
  - json

In [40]:
df3 = pd.read_csv('인적사항.csv', encoding='cp949')
df3

  성별 출생지    키    자산
0  남  서울  180  1000
1  여  인천  170  2000
2  남  부산  165  3000
3  남  서울  175  2000
4  여  인천  160  2500
5  남  대구  173  3200
6  여  부산  170  4000
7  남  서울  178  3500
8  여  서울  164  3000

In [41]:
df3 = pd.read_excel('인적사항.xlsx')
df3

  성별 출생지    키    자산
0  남  서울  180  1000
1  여  인천  170  2000
2  남  부산  165  3000
3  남  서울  175  2000
4  여  인천  160  2500
5  남  대구  173  3200
6  여  부산  170  4000
7  남  서울  178  3500
8  여  서울  164  3000

In [42]:
df3['성별']

0    남
1    여
2    남
3    남
4    여
5    남
6    여
7    남
8    여
Name: 성별, dtype: object

In [43]:
# Fancy Indexing으로 원하는 컬럼들 추출.
df3[['성별','출생지','키']]

  성별 출생지    키
0  남  서울  180
1  여  인천  170
2  남  부산  165
3  남  서울  175
4  여  인천  160
5  남  대구  173
6  여  부산  170
7  남  서울  178
8  여  서울  164

In [44]:
# 특정 컬럼의 데이터 분포 확인
df3['성별'].value_counts()

남    5
여    4
Name: 성별, dtype: int64

In [45]:
# df.head(n) - 상위 n개의 행만 출력
df3.head(2)

  성별 출생지    키    자산
0  남  서울  180  1000
1  여  인천  170  2000

In [46]:
# df.tail(n) - 하위 n개의 행만 출력
df3.tail(3)

  성별 출생지    키    자산
6  여  부산  170  4000
7  남  서울  178  3500
8  여  서울  164  3000

In [47]:
df3.shape # 2차원 데이터프레임의 행, 열 개수

(9, 4)

In [48]:
df3.columns

Index(['성별', '출생지', '키', '자산'], dtype='object')

In [49]:
df3.index

RangeIndex(start=0, stop=9, step=1)

In [50]:
df3.values, type(df3.values)

(array([['남', '서울', 180, 1000],
        ['여', '인천', 170, 2000],
        ['남', '부산', 165, 3000],
        ['남', '서울', 175, 2000],
        ['여', '인천', 160, 2500],
        ['남', '대구', 173, 3200],
        ['여', '부산', 170, 4000],
        ['남', '서울', 178, 3500],
        ['여', '서울', 164, 3000]], dtype=object), numpy.ndarray)

In [51]:
# 컬럼별로 통계량 출력(숫자타입 컬럼만)
df3.describe()

                키           자산
count    9.000000     9.000000
mean   170.555556  2688.888889
std      6.672914   913.023062
min    160.000000  1000.000000
25%    165.000000  2000.000000
50%    170.000000  3000.000000
75%    175.000000  3200.000000
max    180.000000  4000.000000

In [52]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   성별      9 non-null      object
 1   출생지     9 non-null      object
 2   키       9 non-null      int64
 3   자산      9 non-null      int64
dtypes: int64(2), object(2)
memory usage: 416.0+ bytes

In [53]:
df3.T

        0     1     2     3     4     5     6     7     8
성별      남     여     남     남     여     남     여     남     여
출생지    서울    인천    부산    서울    인천    대구    부산    서울    서울
키     180   170   165   175   160   173   170   178   164
자산   1000  2000  3000  2000  2500  3200  4000  3500  3000

In [54]:
df3.sort_values(by='키')

  성별 출생지    키    자산
4  여  인천  160  2500
8  여  서울  164  3000
2  남  부산  165  3000
1  여  인천  170  2000
6  여  부산  170  4000
5  남  대구  173  3200
3  남  서울  175  2000
7  남  서울  178  3500
0  남  서울  180  1000

In [55]:
df3

  성별 출생지    키    자산
0  남  서울  180  1000
1  여  인천  170  2000
2  남  부산  165  3000
3  남  서울  175  2000
4  여  인천  160  2500
5  남  대구  173  3200
6  여  부산  170  4000
7  남  서울  178  3500
8  여  서울  164  3000

In [56]:
df3.sort_values(by='키',
               inplace=True)
df3

  성별 출생지    키    자산
4  여  인천  160  2500
8  여  서울  164  3000
2  남  부산  165  3000
1  여  인천  170  2000
6  여  부산  170  4000
5  남  대구  173  3200
3  남  서울  175  2000
7  남  서울  178  3500
0  남  서울  180  1000

In [57]:
df3.sort_values(by='키',
                ascending=False,
               inplace=True)
df3

  성별 출생지    키    자산
0  남  서울  180  1000
7  남  서울  178  3500
3  남  서울  175  2000
5  남  대구  173  3200
1  여  인천  170  2000
6  여  부산  170  4000
2  남  부산  165  3000
8  여  서울  164  3000
4  여  인천  160  2500

In [58]:
df3.sort_values(by=['출생지','키'],
                ascending=[True,False],
               inplace=True)
df3

  성별 출생지    키    자산
5  남  대구  173  3200
6  여  부산  170  4000
2  남  부산  165  3000
0  남  서울  180  1000
7  남  서울  178  3500
3  남  서울  175  2000
8  여  서울  164  3000
1  여  인천  170  2000
4  여  인천  160  2500

In [80]:
df4 = pd.read_csv('급여정보.csv', encoding='cp949')
df4

   사원번호  1월 급여  2월 급여  3월 급여
0    11    328    333    348
1    12    336    329    392
2    13    317    365    394
3    14    389    373    312
4    15    325    329    342
5    16    311    316    328
6    17    349    385    391
7    18    325    377    395
8    19    330    364    395
9    20    353    396    316

## 데이터 프레임 조회 방법

### 1. loc 인덱서
- 직접 지정한 인덱스 기반으로 인덱싱, 슬라이싱

### 2. iloc 인덱서
- 숫자인덱스로 인덱싱, 슬라이싱
- iloc는 마지막 행은 포함하지 않는다.

In [60]:
df4.loc[0:3,'1월 급여':'2월 급여']

   1월 급여  2월 급여
0    328    333
1    336    329
2    317    365
3    389    373

In [61]:
df4.loc[[1,3],:]

   사원번호  1월 급여  2월 급여  3월 급여
1    12    336    329    392
3    14    389    373    312

In [62]:
df4.iloc[[1,2],[0,2]]

   사원번호  2월 급여
1    12    329
2    13    365

In [82]:
df4['1분기 급여 평균'] = df4[['1월 급여',
                       '2월 급여',
                       '3월 급여']].mean(axis=1)
df4['1분기 급여 합계'] = df4[['1월 급여',
                       '2월 급여',
                       '3월 급여']].sum(axis=1)
df4

   사원번호  1월 급여  2월 급여  3월 급여   1분기 급여 평균  1분기 급여 합계
0    11    328    333    348  336.333333       1009
1    12    336    329    392  352.333333       1057
2    13    317    365    394  358.666667       1076
3    14    389    373    312  358.000000       1074
4    15    325    329    342  332.000000        996
5    16    311    316    328  318.333333        955
6    17    349    385    391  375.000000       1125
7    18    325    377    395  365.666667       1097
8    19    330    364    395  363.000000       1089
9    20    353    396    316  355.000000       1065

In [64]:
df4.set_index('사원번호', inplace=True)
df4

      1월 급여  2월 급여  3월 급여   1분기 급여 평균  1분기 급여 합계
사원번호
11      328    333    348  336.333333       1009
12      336    329    392  352.333333       1057
13      317    365    394  358.666667       1076
14      389    373    312  358.000000       1074
15      325    329    342  332.000000        996
16      311    316    328  318.333333        955
17      349    385    391  375.000000       1125
18      325    377    395  365.666667       1097
19      330    364    395  363.000000       1089
20      353    396    316  355.000000       1065

In [84]:
df4.to_csv('급여정보2.csv',encoding='cp949')

## 데이터 병합

### 1. merge
- 두개의 데이터를 특정 컬럼 기준으로 합친다.
- DB에서 join 기능과 매우 유사

### 2. concat
- 한 데이터 뒤에 다른 데이터를 붙여버린다.

In [66]:
df1 = DataFrame({
    'ID':np.arange(101,106),
    '이름':['둘리','도우너','또치',
          '길동','희동']
})
df1

    ID   이름
0  101   둘리
1  102  도우너
2  103   또치
3  104   길동
4  105   희동

In [67]:
df2 = DataFrame({
    '아이디':[101,105,104],
    '예금':[1000,2000,1500]
})
df2

   아이디    예금
0  101  1000
1  105  2000
2  104  1500

In [68]:
df_merge = pd.merge(df1,df2, left_on='ID',
         right_on='아이디',
        how='outer')
df_merge

    ID   이름    아이디      예금
0  101   둘리  101.0  1000.0
1  102  도우너    NaN     NaN
2  103   또치    NaN     NaN
3  104   길동  104.0  1500.0
4  105   희동  105.0  2000.0

In [69]:
df_merge.drop('아이디', axis=1, inplace=True)
df_merge

    ID   이름      예금
0  101   둘리  1000.0
1  102  도우너     NaN
2  103   또치     NaN
3  104   길동  1500.0
4  105   희동  2000.0

In [70]:
df2.rename(columns={
    '아이디':'ID'
}, inplace=True)
df2

    ID    예금
0  101  1000
1  105  2000
2  104  1500

In [71]:
pd.merge(df1,df2,on='ID')

    ID  이름    예금
0  101  둘리  1000
1  104  길동  1500
2  105  희동  2000

In [72]:
pd.concat([df1,df2], axis=1)

    ID   이름     ID      예금
0  101   둘리  101.0  1000.0
1  102  도우너  105.0  2000.0
2  103   또치  104.0  1500.0
3  104   길동    NaN     NaN
4  105   희동    NaN     NaN

## 그룹핑, 그룹연산

### 1. groupby

### 2. pivot_table

In [73]:
# df3.sort_index(inplace=True)
df3.groupby('성별').sum()

      키     자산
성별
남   871  12700
여   664  11500

In [74]:
df3.groupby(['성별','출생지']).agg('sum')

          키    자산
성별 출생지
남  대구   173  3200
   부산   165  3000
   서울   533  6500
여  부산   170  4000
   서울   164  3000
   인천   330  4500

In [75]:
df3.groupby(['성별','출생지']).agg(['sum','mean'])

          키                자산
        sum        mean   sum         mean
성별 출생지
남  대구   173  173.000000  3200  3200.000000
   부산   165  165.000000  3000  3000.000000
   서울   533  177.666667  6500  2166.666667
여  부산   170  170.000000  4000  4000.000000
   서울   164  164.000000  3000  3000.000000
   인천   330  165.000000  4500  2250.000000

In [76]:
df3.pivot_table(values='자산',
                index='성별',
                aggfunc='mean'
               )

      자산
성별
남   2540
여   2875

In [77]:
df3.pivot_table(values=['키','자산'],
                index='성별',
                aggfunc='mean'
               )

      자산      키
성별
남   2540  174.2
여   2875  166.0

In [78]:
df3.pivot_table(values=['키','자산'],
                index='성별',
                aggfunc=['sum','mean']
               )

      sum       mean
       자산    키    자산      키
성별
남   12700  871  2540  174.2
여   11500  664  2875  166.0

In [79]:
df3.pivot_table(values=['키','자산'],
                index=['성별','출생지'],
                aggfunc=['sum','mean']
               )

         sum              mean
          자산    키           자산           키
성별 출생지
남  대구   3200  173  3200.000000  173.000000
   부산   3000  165  3000.000000  165.000000
   서울   6500  533  2166.666667  177.666667
여  부산   4000  170  4000.000000  170.000000
   서울   3000  164  3000.000000  164.000000
   인천   4500  330  2250.000000  165.000000